[
    {
        "title": "Bestått fagprøve i IT-Utvikling",
        "description": "Jeg avsluttet læretiden min med en oppgave rundt utviklingen av en PWA. Oppgaven varte en uke, og innebærte henting og fremvisning av API-data i et grensesnitt. Løsningen ble utviklet i rammeverket Quasar.",
        "images": [
            {"url": "/bilder/fagprove/1.png", "description": "Fane for logging av daglig matvareforbruk, med matvarer fra matvaretabellen.no sitt API."},
            {"url": "/bilder/fagprove/2.png", "description": "Matvarer og ingredienser kan sammensettes i brukerdefinerte måltid."},
            {"url": "/bilder/fagprove/3.png", "description": "Graf for sammenligning med eldre verdier."}
        ]
    },
    {
        "title": "Lærling hos Anteo AS",
        "description": "Fra 2022 til 2024 var jeg lærling hos SaaS-selskapet Anteo. Der fikk jeg arbeidet med oppgaver rundt webutvikling i hovedsak med frontend men også rundt vedlikehold av eksisterende system. Bruk av JavaScript, React, Vue.",
        "images": [
            {"url": "/bilder/anteo/groups.png", "description": "Her designet og utviklet jeg et enkelt grensesnitt for samling og lagring av båt-grupper til en backend."}, 
            {"url": "/bilder/anteo/monitor.png", "description": "Dette er et bilde av et større lærlingprosjekt som innebærte fremvisning båter og dems oppdrag i sanntid."}, 
            {"url": "/bilder/anteo/warning.png", "description": "En enkel komponent for å hindre brukerfeil."}
        ]
    },
    {
        "title": "Utplasseringselev hos Apility AS",
        "description": "Gjennom VG2 var jeg utplasseringselev hos web-selskapet Apility. Der ble jeg introdusert med bransjens verktøy og samarbeidsmetoder som Git.",
        "images": []
    },
    {
        "title": "Personlige prosjekter",
        "description": "Gjennom skole og fritid har jeg utforsket og lært mer om nye teknologier som har med programmering og koding å gjøre. Utvikling av interaktive program som 3D-spill var noe av det første jeg fikk interesse for.",
        "images": [
            {"url": "/bilder/personal/trembl.png", "description": "Et skoleprosjekt for et bærekraftig kommunikasjonsmiddel for funksjonshemmede."}, 
            {"url": "/bilder/personal/scr.png", "description": "En enkel helikopter-simulator utviklet i Godot3D."}, 
            {"url": "/bilder/personal/sudok.png", "description": "På etterspørsel av et familiemedlem, en nettside for tegning av sumsudoku."}
        ]
    }
]